Merge pull request #135 from Mr-Robotiko/Documentation_review
Documentation review
